docs/articles/github_identities.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Multiple GitHub Accounts</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Using Multiple GitHub Accounts</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org554f29d">The Problem</a></li>
<li><a href="#the-ssh-config">The SSH Config</a></li>
<li><a href="#org44f48c7">The Git Config</a>
<ul>
<li><a href="#config-loading">More about Git Config Loading</a></li>
</ul>
</li>
<li><a href="#signed-commits">Signed Commits</a>
<ul>
<li><a href="#org2bf1fcd">Rationale</a></li>
<li><a href="#org83c743b">Prerequisites</a></li>
<li><a href="#org14882d8">Create PGP key</a></li>
<li><a href="#org33c1c2e">Add key ID to git config</a></li>
<li><a href="#org97fc0db">Update gpg-agent.conf</a></li>
<li><a href="#org88089ab">Make a git commit</a></li>
<li><a href="#orgdd14d4a">Add public key to GitHub</a></li>
</ul>
</li>
<li><a href="#org6714193">More Resources</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org554f29d" class="outline-2">
<h2 id="org554f29d"><a href="#org554f29d">The Problem</a></h2>
<div class="outline-text-2" id="text-org554f29d">
<p>
You have multiple GitHub accounts, and you want git to automatically use the
"right" GitHub account.
</p>

<p>
A good way to do that is to put work-related stuff under a single directory,
say, <code>~/Work</code>. Then, configure git to use your <b>work</b> account any project in
your <code>~/Work</code> directory.
</p>

<p>
In this article I set things up so that:
</p>

<ul class="org-ul">
<li>Projects in your <code>~/Work/</code> directory use your <b>work</b> GitHub account</li>
<li>Projects elsewhere use your <b>home</b> GitHub account</li>
</ul>

<p>
My git configuration <a href="https://github.com/cfclrk/dotfiles/tree/master/xdg_config/git">on GitHub</a> is generated from this article.
</p>
</div>
</div>

<div id="outline-container-the-ssh-config" class="outline-2">
<h2 id="the-ssh-config"><a href="#the-ssh-config">The SSH Config</a></h2>
<div class="outline-text-2" id="text-the-ssh-config">
<p>
Assuming you use the <code>git</code> protocol to clone repositories (not <code>https</code>), you
must create at least two SSH keys for GitHub &#x2013; one for each GitHub account
(GitHub will not allow you to use the same SSH key for both accounts). Once
you've <a href="https://docs.github.com/en/github/authenticating-to-github/connecting-to-github-with-ssh">created</a> those, your <code>~/.ssh</code> directory should look something like:
</p>

<pre class="example" id="orga7ca5e9">
$ tree ~/.ssh/
/Users/cfclrk/.ssh/
├── config
├── github-home
├── github-home.pub
├── github-work
└── github-work.pub
</pre>

<p>
Ensure these SSH keys work:
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh -i ~/.ssh/github-home -T git@github.com 2&gt;&amp;1 || true
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
Hi cfclrk! You've successfully authenticated,
but GitHub does not provide shell access.
</pre>


<div class="org-src-container">
<pre class="src src-sh">ssh -i ~/.ssh/github-work -T git@github.com 2&gt;&amp;1 || true
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
Hi chrisc-ironnet! You've successfully authenticated,
but GitHub does not provide shell access.
</pre>


<p>
We don't need to modify the <code>~/.ssh/config</code> file. Instead, we'll explicitly
tell git which SSH keys to use in our git config files.
</p>
</div>
</div>

<div id="outline-container-org44f48c7" class="outline-2">
<h2 id="org44f48c7"><a href="#org44f48c7">The Git Config</a></h2>
<div class="outline-text-2" id="text-org44f48c7">
<p>
First, tell git to use different git configurations depending on the directory
a project is in. Git supports this with the <a href="https://git-scm.com/docs/git-config#_conditional_includes">includeIf</a> directive. Do this by
creating the following two files.
</p>

<p>
<code>~/.config/git/config</code>
</p>

<div class="org-src-container">
<pre class="src src-gitconfig">[<span style="color: #ECBE7B;">user</span>]
    <span style="color: #dcaeea;">name</span> = Chris Clark
    <span style="color: #dcaeea;">email</span> = cfclrk@gmail.com
    <span style="color: #dcaeea;">signingkey</span> = 80027A20FC0B6207
[<span style="color: #ECBE7B;">core</span>]
    <span style="color: #dcaeea;">sshCommand</span> = <span style="color: #98be65;">"ssh -i ~/.ssh/github-home"</span>
[<span style="color: #ECBE7B;">commit</span>]
    <span style="color: #dcaeea;">gpgsign</span> = <span style="color: #51afef;">true</span>
[<span style="color: #ECBE7B;">init</span>]
    <span style="color: #dcaeea;">defaultBranch</span> = main
[<span style="color: #ECBE7B;">includeIf</span> <span style="color: #c678dd;">"gitdir:~/Work/"</span>]
    <span style="color: #dcaeea;">path</span> = work.gitconfig
[<span style="color: #ECBE7B;">github</span>]
    <span style="color: #dcaeea;">user</span> = cfclrk
</pre>
</div>

<p>
<code>~/.config/git/work.gitconfig</code>
</p>

<div class="org-src-container">
<pre class="src src-gitconfig">[<span style="color: #ECBE7B;">user</span>]
    <span style="color: #dcaeea;">email</span> = chris.clark@ironnet.com
    <span style="color: #dcaeea;">signingkey</span> = EDC41C0910322DD6
[<span style="color: #ECBE7B;">core</span>]
    <span style="color: #dcaeea;">sshCommand</span> = <span style="color: #98be65;">"ssh -i ~/.ssh/github-work"</span>
[<span style="color: #ECBE7B;">github</span>]
    <span style="color: #dcaeea;">user</span> = chrisc-ironnet
</pre>
</div>

<p>
Ignore the <code>[github]</code> sections; those are for <a href="https://github.com/magit/forge">Emacs forge</a>. And of course,
update the values for your <code>name</code>, <code>email</code>, and &#x2013; if you're using
<a href="#signed-commits">Signed Commits</a> &#x2013; your PGP <code>signingkey</code> id.
</p>

<p>
That's it for the git config! Move on to <a href="#signed-commits">Signed Commits</a>. The next subsection
explains the above, if you are interested.
</p>
</div>

<div id="outline-container-config-loading" class="outline-3">
<h3 id="config-loading"><a href="#config-loading">More about Git Config Loading</a></h3>
<div class="outline-text-3" id="text-config-loading">
<p>
Git loads <i>all</i> applicable config files. If one option is set multiple times
(potentially form differnt files), the last value wins.
</p>

<p>
For example: assume you have the git config files above, which has:
</p>

<div class="org-src-container">
<pre class="src src-gitconfig">[<span style="color: #ECBE7B;">includeIf</span> <span style="color: #c678dd;">"gitdir:~/Work/"</span>]
    <span style="color: #dcaeea;">path</span> = work.gitconfig
</pre>
</div>

<p>
Now, when you run a git command in a project located at <code>~/Work/projectA/</code>,
git does something like:
</p>

<ul class="org-ul">
<li>Load the default <code>~/.config/git/config</code> file
<ul class="org-ul">
<li>Set <code>user.email</code> to <code>cfclrk@gmail.com</code></li>
</ul></li>
<li>Does <code>[includeIf "gitdir:~/Work/"]</code> apply?
<ul class="org-ul">
<li><b>Yes!</b> Load the work.gitconfig file</li>
<li>Set <code>user.email</code> to <code>chris.clark@ironnet.com</code></li>
</ul></li>
</ul>

<p>
Both the default and <i>work</i> config files get loaded. The email address ends
up being <code>chris.clark@ironnet.com</code> since that was the <b>last</b> value loaded for
the <code>user.email</code> option. The determining factor is the <i>order in which the
configuration is defined</i>, and the <i>last value wins</i>.
</p>

<p>
If you define multiple <code>includeIf</code> directives that overwrite one another,
specify them in order from <i>most general</i> to <i>most specific</i>.
</p>
</div>
</div>
</div>

<div id="outline-container-signed-commits" class="outline-2">
<h2 id="signed-commits"><a href="#signed-commits">Signed Commits</a></h2>
<div class="outline-text-2" id="text-signed-commits">
</div>

<div id="outline-container-org2bf1fcd" class="outline-3">
<h3 id="org2bf1fcd"><a href="#org2bf1fcd">Rationale</a></h3>
<div class="outline-text-3" id="text-org2bf1fcd">
<p>
Why sign commits?
</p>

<p>
The value of <code>user.email</code> is the only piece of information GitHub uses when
determining what profile picture to display next to a commit. You can set that
email address to anything! E.g. set it to <code>torvalds@linux-foundation.org</code>, and
GitHub will happily put Linus Torvalds' picture next to your git commits. And
to be sure, <a href="https://news.ycombinator.com/item?id=10005577">that happens</a>.
</p>

<p>
If you don't want other people impersonating you, you can <i>partially</i> mitigate
this problem of attribution by using <a href="https://git-scm.com/book/en/v2/Git-Tools-Signing-Your-Work">signed commits</a>.
</p>

<p>
GitHub allows you to upload a PGP key to your GitHub account, and GitHub
displays a "Verified" badge on commits that proprely verify (i.e. <code>git
  verify-commit &lt;commit&gt;</code> works). For a commit to verify,
</p>

<ol class="org-ol">
<li>The email address in the commit must match your GitHub account email
address</li>
<li>The commit must be signed by a PGP key that has been uploaded to
your GitHub account</li>
</ol>
</div>
</div>

<div id="outline-container-org83c743b" class="outline-3">
<h3 id="org83c743b"><a href="#org83c743b">Prerequisites</a></h3>
<div class="outline-text-3" id="text-org83c743b">
<p>
First install the necessary tools:
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install gnupg
brew install pinentry-mac
</pre>
</div>

<p>
<code>pinentry-mac</code> saves passphrases in the MacOS keychain.
</p>
</div>
</div>

<div id="outline-container-org14882d8" class="outline-3">
<h3 id="org14882d8"><a href="#org14882d8">Create PGP key</a></h3>
<div class="outline-text-3" id="text-org14882d8">
<p>
Although GitHub <a href="https://docs.github.com/en/authentication/managing-commit-signature-verification/generating-a-new-gpg-key">has some instructions</a> for creating a PGP key, I prefer using
<a href="https://keybase.io/">keybase</a>. By using keybase, you ensure you don't lose your keys, and it can
make moving to a new computer much easier.
</p>

<p>
To use keybase, first install the <a href="https://keybase.io/download">native app</a> (this installs the <code>keybase</code> CLI
program).
</p>

<p>
You could import existing PGP keys from keybase, but it's a better idea to
create a new PGP key for every device. So, create two new PGP keys.
</p>

<p>
TODO: Can I just use one key, and add two email addresses to it as <a href="https://docs.github.com/en/authentication/managing-commit-signature-verification/associating-an-email-with-your-gpg-key">described
here</a>? Or does GitHub make you use different keys for different accounts?
</p>

<p>
Home key:
</p>

<div class="org-src-container">
<pre class="src src-sh">keybase pgp gen --multi
</pre>
</div>

<p>
Work key:
</p>

<div class="org-src-container">
<pre class="src src-sh">keybase pgp gen --multi
</pre>
</div>

<p>
TODO: Should we update the trust level on each key to ultimate?
</p>

<p>
For completeness, if you <span class="underline">do</span> want to import a key instead of creating a new one:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Import your public pgp key</span>
keybase pgp export -q $<span style="color: #dcaeea;">keyid</span> <span style="color: #98be65;">\</span>
    | gpg --import
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Import your private pgp key</span>
keybase pgp export -q $<span style="color: #dcaeea;">keyid</span> <span style="color: #98be65;">\</span>
        --secret <span style="color: #98be65;">\</span>
    | gpg --allow-secret-key <span style="color: #98be65;">\</span>
          --import
</pre>
</div>
</div>
</div>

<div id="outline-container-org33c1c2e" class="outline-3">
<h3 id="org33c1c2e"><a href="#org33c1c2e">Add key ID to git config</a></h3>
<div class="outline-text-3" id="text-org33c1c2e">
<p>
Get the GPG key ID of your PGP key. To get the key ID:
</p>

<div class="org-src-container">
<pre class="src src-sh">gpg --list-secret-keys --keyid-format=long
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
/Users/cfclrk/.gnupg/pubring.kbx
--------------------------------
sec   rsa4096/80027A20FC0B6207 2022-03-14 [SC] [expires: 2038-03-10]
      2DEF144646C3152AE294CC5D80027A20FC0B6207
uid                 [ultimate] Chris Clark &lt;cfclrk@gmail.com&gt;
ssb   rsa4096/799C916E01D155A3 2022-03-14 [E] [expires: 2038-03-10]
</pre>


<p>
In the above, the key ID is <code>80027A20FC0B6207</code> (is there some command that
prints out the key id?). Update your git config like so:
</p>

<div class="org-src-container">
<pre class="src src-gitconfig">[<span style="color: #ECBE7B;">user</span>]
    <span style="color: #dcaeea;">signingkey</span> = 80027A20FC0B6207
[<span style="color: #ECBE7B;">commit</span>]
    <span style="color: #dcaeea;">gpgsign</span> = <span style="color: #51afef;">true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org97fc0db" class="outline-3">
<h3 id="org97fc0db"><a href="#org97fc0db">Update gpg-agent.conf</a></h3>
<div class="outline-text-3" id="text-org97fc0db">
<p>
Add the following to <code>~/.gnupg/gpg-agent.conf</code>. This allows for automatic
signing (on MacOS anyway).
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Connects gpg-agent to the MacOS keychain. This enables</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">automatic key signing.</span>
pinentry-program /usr/local/bin/pinentry-mac
</pre>
</div>
</div>
</div>

<div id="outline-container-org88089ab" class="outline-3">
<h3 id="org88089ab"><a href="#org88089ab">Make a git commit</a></h3>
<div class="outline-text-3" id="text-org88089ab">
<p>
If you used a passphrase on your PGP key, your first git commit will probably
fail. For your first git commit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">GPG_TTY</span>=$(tty)
</pre>
</div>

<p>
Now, when you make a git commit, it should prompt you for the PGP key's
passphrase. After you do this once, you should never have to do it again.
</p>
</div>
</div>

<div id="outline-container-orgdd14d4a" class="outline-3">
<h3 id="orgdd14d4a"><a href="#orgdd14d4a">Add public key to GitHub</a></h3>
<div class="outline-text-3" id="text-orgdd14d4a">
<p>
TODO: <code>keybase pgp export $keyid</code> and <code>gpg --armor --export $keyid</code> create
different things. Do they both work? Which is more appropriate to put in
GitHub?
</p>

<div class="org-src-container">
<pre class="src src-sh">keybase pgp export -q $<span style="color: #dcaeea;">keyid</span> | pbcopy
</pre>
</div>

<p>
Add this key to GitHub.
</p>
</div>
</div>
</div>

<div id="outline-container-org6714193" class="outline-2">
<h2 id="org6714193"><a href="#org6714193">More Resources</a></h2>
<div class="outline-text-2" id="text-org6714193">
<ul class="org-ul">
<li><a href="https://yayimorphology.org/ssh-identities-made-easy.html">Managing several SSH identities explained</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
